app/views/teams/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
          <% @team.members_id.each do |id| %>
            <li class="list-group-item"><%= link_to User.find(id).name, User.find(id) %></li>