app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "michael@michaelhartl.com"]]
---
  def edit
    user = User.find_by(email: params[:email])