app/controllers/pages_controller.rb

  def show
    begin
      @page = Page.friendly.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @page = Page.new(page_params)
    if @page.save
---
INSERT INTO "pages" ("title", "content", "in_nav", "published", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    get_page
    @page.slug = nil
    if @page.update_attributes(page_params)
---
UPDATE "pages" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["title", "Niggerjew"], ["content", "<p>Lorem ipsum dolor sit amet.</p>\r\n\r\n<p>&nbsp;</p>\r\n"], ["updated_at", "2015-08-22 11:37:01.927362"], ["id", 2]]

  def destroy
    Page.friendly.find(params[:id]).destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 3]]