app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      flash.now[:danger] = "Полето за парола е празно."
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$ipdPdZiUwMGAMWKq6i9eHO3o/qsesN/.78.cuCp3FkJKT4/S1VsnO"], ["updated_at", "2015-08-21 21:52:12.435919"], ["id", 762146111]]