app/controllers/teams_controller.rb

  def index
    @teams = Team.paginate(page: params[:page])
---
SELECT  "teams".* FROM "teams" LIMIT 30 OFFSET 0
SELECT "pages".* FROM "pages"
SELECT COUNT(*) FROM "teams"

  def show
    @team = Team.find(params[:id])
    @captain = User.find(@team.captain_id)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @team = Team.new(team_params)
    @team.update(captain_id: session[:user_id])
    params[:team][:technologies] = params[:team][:technologies].split("\n")
    User.find(@team.captain_id).update(team_id: @team.id)
    if @team.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "team_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["team_id", 6], ["updated_at", "2015-08-23 14:28:03.561990"], ["id", 1]]
INSERT INTO "teams" ("name", "project_name", "project_desc", "captain_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Foo"], ["project_name", "Some project"], ["project_desc", "aergarg"], ["captain_id", 1], ["created_at", "2015-08-23 14:26:49.713952"], ["updated_at", "2015-08-23 14:26:49.713952"]]

  def destroy
    @team = Team.find(params[:id])
    User.find(@team.captain_id).update(team_id: nil)
    @members = @team.members_id
    @members.each do |id|
      User.find(id).update(team_id: nil)
    end
    @team.destroy
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 6]]