app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT "pages".* FROM "pages"
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$o3FakZerENhsmgsXwTvnvOjo08bzqoEAnZkkCCqmhjISiwHb3Utgy"], ["updated_at", "2015-08-21 17:23:49.180848"], ["id", 1]]