app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    if @user == current_user && @user.team_id == nil
      @invites = Invite.where(to_id: @user.id)
      if @invites.any?
        @invites.each do |invite|
          @from_user = User.find(invite.from_id)
          @from_team = Team.find(@from_user.team_id)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", nil]]