app/views/layouts/_header.html.erb


        <% Page.all.each do |p| %>
---
SELECT "pages".* FROM "pages"